## Plan Result (prod-global)




<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * module.landing_zone.azurerm_frontdoor_custom_https_configuration.https[&#34;et-sya&#34;]
* Update
  * module.landing_zone.azurerm_frontdoor.main
  * module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.landing_zone.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.landing_zone.azurerm_frontdoor.main will be updated in-place
  ~ resource "azurerm_frontdoor" "main" {
        id                                           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod"
        name                                         = "hmcts-prod"
        tags                                         = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (14 unchanged attributes hidden)

      + backend_pool {
          + health_probe_name   = "healthProbeSettings-et-sya"
          + load_balancing_name = "loadBalancingSettings-et-sya"
          + name                = "et-sya"

          + backend {
              + address     = "firewall-prod-int-palo-prod.uksouth.cloudapp.azure.com"
              + enabled     = true
              + host_header = "claim-employment-tribunals.service.gov.uk"
              + http_port   = 80
              + https_port  = 443
              + priority    = 1
              + weight      = 50
            }
        }

      + backend_pool_health_probe {
          + enabled             = true
          + interval_in_seconds = 120
          + name                = "healthProbeSettings-et-sya"
          + path                = "/health/liveness"
          + probe_method        = "GET"
          + protocol            = "Http"
        }

      + backend_pool_load_balancing {
          + additional_latency_milliseconds = 0
          + name                            = "loadBalancingSettings-et-sya"
          + sample_size                     = 4
          + successful_samples_required     = 2
        }

      ~ frontend_endpoint {
          ~ host_name                               = "www.fees-register.platform.hmcts.net" -> "claim-employment-tribunals.service.gov.uk"
            id                                      = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/wwwfees-register"
          ~ name                                    = "wwwfees-register" -> "et-sya"
          + web_application_firewall_policy_link_id = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoorWebApplicationFirewallPolicies/etsyaprod"
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                    = "www.paybubble.platform.hmcts.net" -> "www.fees-register.platform.hmcts.net"
            id                           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/wwwpaybubble"
          ~ name                         = "wwwpaybubble" -> "wwwfees-register"
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                    = "www.manage-payments.platform.hmcts.net" -> "www.paybubble.platform.hmcts.net"
            id                           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/wwwmanage-payments"
          ~ name                         = "wwwmanage-payments" -> "wwwpaybubble"
            # (2 unchanged attributes hidden)
        }
      ~ frontend_endpoint {
          ~ host_name                    = "www.paymentoutcome-web.platform.hmcts.net" -> "www.manage-payments.platform.hmcts.net"
            id                           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/wwwpayment-outcome"
          ~ name                         = "wwwpayment-outcome" -> "wwwmanage-payments"
            # (2 unchanged attributes hidden)
        }
      + frontend_endpoint {
          + host_name                    = "www.paymentoutcome-web.platform.hmcts.net"
          + name                         = "wwwpayment-outcome"
          + session_affinity_enabled     = false
          + session_affinity_ttl_seconds = 0
        }

      ~ routing_rule {
          ~ accepted_protocols = [
              - "Http",
              + "Https",
            ]
          ~ frontend_endpoints = [
              - "plum",
              + "et-sya",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/plumHttpsRedirect"
          ~ name               = "plumHttpsRedirect" -> "et-sya"
            # (2 unchanged attributes hidden)

          + forwarding_configuration {
              + backend_pool_name                     = "et-sya"
              + cache_enabled                         = true
              + cache_query_parameter_strip_directive = "StripNone"
              + cache_use_dynamic_compression         = false
              + forwarding_protocol                   = "HttpOnly"
            }

          - redirect_configuration {
              - redirect_protocol = "HttpsOnly" -> null
              - redirect_type     = "Moved" -> null
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "div-dn",
              + "plum",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/div-dnHttpsRedirect"
          ~ name               = "div-dnHttpsRedirect" -> "plumHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "div-da",
              + "div-dn",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/div-daHttpsRedirect"
          ~ name               = "div-daHttpsRedirect" -> "div-dnHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "div-rfe",
              + "div-da",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/div-rfeHttpsRedirect"
          ~ name               = "div-rfeHttpsRedirect" -> "div-daHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "div-pfe",
              + "div-rfe",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/div-pfeHttpsRedirect"
          ~ name               = "div-pfeHttpsRedirect" -> "div-rfeHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "div-amend",
              + "div-pfe",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/div-amendHttpsRedirect"
          ~ name               = "div-amendHttpsRedirect" -> "div-pfeHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "nfdiv-civil-partnership",
              + "div-amend",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/nfdiv-civil-partnershipHttpsRedirect"
          ~ name               = "nfdiv-civil-partnershipHttpsRedirect" -> "div-amendHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "sscs-tribunals",
              + "nfdiv-civil-partnership",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/sscs-tribunalsHttpsRedirect"
          ~ name               = "sscs-tribunalsHttpsRedirect" -> "nfdiv-civil-partnershipHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "sscs-tya",
              + "sscs-tribunals",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/sscs-tyaHttpsRedirect"
          ~ name               = "sscs-tyaHttpsRedirect" -> "sscs-tribunalsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "sscs-cor",
              + "sscs-tya",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/sscs-corHttpsRedirect"
          ~ name               = "sscs-corHttpsRedirect" -> "sscs-tyaHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "xui-webapp",
              + "sscs-cor",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/xui-webappHttpsRedirect"
          ~ name               = "xui-webappHttpsRedirect" -> "sscs-corHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "xui-manage-org",
              + "xui-webapp",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/xui-manage-orgHttpsRedirect"
          ~ name               = "xui-manage-orgHttpsRedirect" -> "xui-webappHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "xui-approve-org",
              + "xui-manage-org",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/xui-approve-orgHttpsRedirect"
          ~ name               = "xui-approve-orgHttpsRedirect" -> "xui-manage-orgHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "xui-register-org",
              + "xui-approve-org",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/xui-register-orgHttpsRedirect"
          ~ name               = "xui-register-orgHttpsRedirect" -> "xui-approve-orgHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "cmc",
              + "xui-register-org",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/cmcHttpsRedirect"
          ~ name               = "cmcHttpsRedirect" -> "xui-register-orgHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "cmc-legal",
              + "cmc",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/cmc-legalHttpsRedirect"
          ~ name               = "cmc-legalHttpsRedirect" -> "cmcHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "gateway-ccd",
              + "cmc-legal",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/gateway-ccdHttpsRedirect"
          ~ name               = "gateway-ccdHttpsRedirect" -> "cmc-legalHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "return-case-doc-ccd",
              + "gateway-ccd",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/return-case-doc-ccdHttpsRedirect"
          ~ name               = "return-case-doc-ccdHttpsRedirect" -> "gateway-ccdHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "probate",
              + "return-case-doc-ccd",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/probateHttpsRedirect"
          ~ name               = "probateHttpsRedirect" -> "return-case-doc-ccdHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "ia-aip",
              + "probate",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/ia-aipHttpsRedirect"
          ~ name               = "ia-aipHttpsRedirect" -> "probateHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fees-register",
              + "ia-aip",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/fees-registerHttpsRedirect"
          ~ name               = "fees-registerHttpsRedirect" -> "ia-aipHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "paybubble",
              + "fees-register",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/paybubbleHttpsRedirect"
          ~ name               = "paybubbleHttpsRedirect" -> "fees-registerHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "manage-payments",
              + "paybubble",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/manage-paymentsHttpsRedirect"
          ~ name               = "manage-paymentsHttpsRedirect" -> "paybubbleHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "payment-outcome",
              + "manage-payments",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/payment-outcomeHttpsRedirect"
          ~ name               = "payment-outcomeHttpsRedirect" -> "manage-paymentsHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-web-public",
              + "payment-outcome",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/idam-web-publicHttpsRedirect"
          ~ name               = "idam-web-publicHttpsRedirect" -> "payment-outcomeHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "pcq",
              + "idam-web-public",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/pcqHttpsRedirect"
          ~ name               = "pcqHttpsRedirect" -> "idam-web-publicHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "lau",
              + "pcq",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/lauHttpsRedirect"
          ~ name               = "lauHttpsRedirect" -> "pcqHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "cft-api-mgmt",
              + "lau",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/cft-api-mgmtHttpsRedirect"
          ~ name               = "cft-api-mgmtHttpsRedirect" -> "lauHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fact",
              + "cft-api-mgmt",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/factHttpsRedirect"
          ~ name               = "factHttpsRedirect" -> "cft-api-mgmtHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fact-admin",
              + "fact",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/fact-adminHttpsRedirect"
          ~ name               = "fact-adminHttpsRedirect" -> "factHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "fact-redirect",
              + "fact-admin",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/fact-redirectHttpsRedirect"
          ~ name               = "fact-redirectHttpsRedirect" -> "fact-adminHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "jui-redirect",
              + "fact-redirect",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/jui-redirectHttpsRedirect"
          ~ name               = "jui-redirectHttpsRedirect" -> "fact-redirectHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-web-admin",
              + "jui-redirect",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/idam-web-adminHttpsRedirect"
          ~ name               = "idam-web-adminHttpsRedirect" -> "jui-redirectHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "idam-user-dashboard",
              + "idam-web-admin",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/idam-user-dashboardHttpsRedirect"
          ~ name               = "idam-user-dashboardHttpsRedirect" -> "idam-web-adminHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "hmi-apim",
              + "idam-user-dashboard",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/hmi-apimHttpsRedirect"
          ~ name               = "hmi-apimHttpsRedirect" -> "idam-user-dashboardHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "reformscan",
              + "hmi-apim",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/reformscanHttpsRedirect"
          ~ name               = "reformscanHttpsRedirect" -> "hmi-apimHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "adoption",
              + "reformscan",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/adoptionHttpsRedirect"
          ~ name               = "adoptionHttpsRedirect" -> "reformscanHttpsRedirect"
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ routing_rule {
          ~ accepted_protocols = [
                "Http",
              - "Https",
            ]
          ~ frontend_endpoints = [
              - "wwwfees-register",
              + "adoption",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/fees-registerwwwRedirect"
          ~ name               = "fees-registerwwwRedirect" -> "adoptionHttpsRedirect"
            # (2 unchanged attributes hidden)

          ~ redirect_configuration {
              - custom_host       = "fees-register.platform.hmcts.net" -> null
                # (2 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ accepted_protocols = [
                "Http",
              - "Https",
            ]
          ~ frontend_endpoints = [
              - "wwwpaybubble",
              + "et-sya",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/paybubblewwwRedirect"
          ~ name               = "paybubblewwwRedirect" -> "et-syaHttpsRedirect"
            # (2 unchanged attributes hidden)

          ~ redirect_configuration {
              - custom_host       = "paybubble.platform.hmcts.net" -> null
                # (2 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "wwwmanage-payments",
              + "wwwfees-register",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/manage-paymentswwwRedirect"
          ~ name               = "manage-paymentswwwRedirect" -> "fees-registerwwwRedirect"
            # (3 unchanged attributes hidden)

          ~ redirect_configuration {
              ~ custom_host       = "manage-payments.platform.hmcts.net" -> "fees-register.platform.hmcts.net"
                # (2 unchanged attributes hidden)
            }
        }
      ~ routing_rule {
          ~ frontend_endpoints = [
              - "wwwpayment-outcome",
              + "wwwpaybubble",
            ]
            id                 = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/routingRules/payment-outcomewwwRedirect"
          ~ name               = "payment-outcomewwwRedirect" -> "paybubblewwwRedirect"
            # (3 unchanged attributes hidden)

          ~ redirect_configuration {
              ~ custom_host       = "paymentoutcome-web.platform.hmcts.net" -> "paybubble.platform.hmcts.net"
                # (2 unchanged attributes hidden)
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "wwwmanage-payments",
            ]
          + name               = "manage-paymentswwwRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + custom_host       = "manage-payments.platform.hmcts.net"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }
      + routing_rule {
          + accepted_protocols = [
              + "Http",
              + "Https",
            ]
          + enabled            = true
          + frontend_endpoints = [
              + "wwwpayment-outcome",
            ]
          + name               = "payment-outcomewwwRedirect"
          + patterns_to_match  = [
              + "/*",
            ]

          + redirect_configuration {
              + custom_host       = "paymentoutcome-web.platform.hmcts.net"
              + redirect_protocol = "HttpsOnly"
              + redirect_type     = "Moved"
            }
        }

        # (191 unchanged blocks hidden)
    }

  # module.landing_zone.azurerm_frontdoor_custom_https_configuration.https["et-sya"] will be created
  + resource "azurerm_frontdoor_custom_https_configuration" "https" {
      + custom_https_provisioning_enabled = true
      + frontend_endpoint_id              = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod/frontendEndpoints/et-sya"
      + id                                = (known after apply)

      + custom_https_configuration {
          + certificate_source    = "FrontDoor"
          + minimum_tls_version   = (known after apply)
          + provisioning_state    = (known after apply)
          + provisioning_substate = (known after apply)
        }
    }

  # module.landing_zone.azurerm_monitor_diagnostic_setting.frontdoor_diagnostics will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "frontdoor_diagnostics" {
        id                         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/lz-prod-rg/providers/Microsoft.Network/frontDoors/hmcts-prod|fd-log-analytics"
        name                       = "fd-log-analytics"
        # (2 unchanged attributes hidden)

      - log {
          - category = "FrontdoorAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "FrontdoorWebApplicationFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1204,"Program":"tfcmt","SHA1":"","Target":"prod-global","Vars":{}} -->